Revit 2026 API

# AreaTagArea Property

---

The area that the tag is associated with.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Area Area { get; }
```
```vb
Public ReadOnly Property Area As Area
	Get
```
```cpp
public:
property Area^ Area {
	Area^ get ();
}
```
```fsharp
member Area : Area with get
```

#### Property Value

Area

In rare cases, the tag may not be associated to an area. The property will be  in these situations.

#### Reference

AreaTag Class

Autodesk.Revit.DB Namespace